kernel/2014-10-02-linux-kernel-object.org
#+TITLE: Linux Kernel Object
#+AUTHOR: Micky Ching
#+OPTIONS: H:4 ^:nil toc:nil
#+LATEX_CLASS: latex-doc

* kobject
相关文件：
- include/linux/kobject.h
- include/linux/kref.h
- lib/kobject.c
- lib/kobject_uevent.c

在使用的时候将kobject嵌入到其他数据结构中。
#+BEGIN_SRC cpp
  struct kobject {
      const char              *name;      // 目录名字
      struct list_head        entry;      // head: kset->list
      struct kobject          *parent;    // 父对象
      struct kset             *kset;      // 所属集合
      struct kobj_type        *ktype;     // 所属类型
      struct kernfs_node      *sd;        // 关联对象与sysfs
      struct kref             kref;       // 引用计数
  #ifdef CONFIG_DEBUG_KOBJECT_RELEASE
      struct delayed_work     release;
  #endif
      unsigned int state_initialized:1;
      unsigned int state_in_sysfs:1;
      unsigned int state_add_uevent_sent:1;
      unsigned int state_remove_uevent_sent:1;
      unsigned int uevent_suppress:1;     // 禁止发送uevent
  };
#+END_SRC
kset和ktype容易混淆，ktype的概念类似于类型，因为包含析构函数，
而kset的概念类似于集合，将多个kobject放在一起。

** kref
#+BEGIN_SRC cpp
  struct kref {
      atomic_t refcount;
  };
  void kref_init(struct kref *kref);      // 初始化为1
  void kref_get(struct kref *kref);       // 增加计数
  int kref_put(struct kref *kref,         // 减少计数
               void (*release)(struct kref *kref));
  int __must_check kref_get_unless_zero(struct kref *kref);
#+END_SRC
当kref的计数减少到0的时候，就会有别的线程去释放对象，
此时如果去执行kref_get()就会出现竞态问题，
比较安全的做法是使用kref_get_unless_zero()。

** kobj_type
kobj_type相当于kobject的类型，包括了对sysfs操作的方法，
以及对kobject释放的析构函数。
#+BEGIN_SRC cpp
  struct kobj_type {
      void (*release)(struct kobject *kobj);
      const struct sysfs_ops *sysfs_ops;
      struct attribute **default_attrs;
      const struct kobj_ns_type_operations *
      (*child_ns_type)(struct kobject *kobj);
      const void *(*namespace)(struct kobject *kobj);
  };
  struct sysfs_ops {
      ssize_t (*show)(struct kobject *kobj, struct attribute *attr,
                      char *buf);
      ssize_t (*store)(struct kobject *kobj, struct attribute *attr,
                       const char *buf, size_t len);
  };
#+END_SRC
