kernel/2014-10-02-linux-kernel-object.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Linux Kernel Object</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Micky Ching" />
<link rel="stylesheet" href="../theme/default.css" />


</head>
<body>
<div id="content">
<h1 class="title">Linux Kernel Object</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. kobject</a>
<ul>
<li><a href="#sec-1-1">1.1. kref</a></li>
<li><a href="#sec-1-2">1.2. kobj_type</a></li>
<li><a href="#sec-1-3">1.3. kset</a></li>
<li><a href="#sec-1-4">1.4. kobject操作</a></li>
</ul>
</li>
<li><a href="#sec-2">2. uevent</a>
<ul>
<li><a href="#sec-2-1">2.1. kobject_uevent()</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> kobject</h2>
<div class="outline-text-2" id="text-1">
<p>
相关文件：
</p>
<ul class="org-ul">
<li>include/linux/kobject.h
</li>
<li>include/linux/kref.h
</li>
<li>lib/kobject.c
</li>
<li>lib/kobject_uevent.c
</li>
</ul>

<p>
在使用的时候将kobject嵌入到其他数据结构中。
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> {
    <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span>              *<span style="color: #000000;">name</span>;      <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#30446;&#24405;&#21517;&#23383;</span>
    <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span>        <span style="color: #000000;">entry</span>;      <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">head: kset-&gt;list</span>
    <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span>          *<span style="color: #000000;">parent</span>;    <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#29238;&#23545;&#35937;</span>
    <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kset</span>             *<span style="color: #000000;">kset</span>;      <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#25152;&#23646;&#38598;&#21512;</span>
    <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobj_type</span>        *<span style="color: #000000;">ktype</span>;     <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#25152;&#23646;&#31867;&#22411;</span>
    <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kernfs_node</span>      *<span style="color: #000000;">sd</span>;        <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#20851;&#32852;&#23545;&#35937;&#19982;sysfs</span>
    <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kref</span>             <span style="color: #000000;">kref</span>;       <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#24341;&#29992;&#35745;&#25968;</span>
<span style="color: #000000;">#ifdef</span> CONFIG_DEBUG_KOBJECT_RELEASE
    <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">delayed_work</span>     <span style="color: #000000;">release</span>;
<span style="color: #000000;">#endif</span>
    <span style="color: #0000ff;">unsigned</span> <span style="color: #0000ff;">int</span> <span style="color: #000000;">state_initialized</span>:1;
    <span style="color: #0000ff;">unsigned</span> <span style="color: #0000ff;">int</span> <span style="color: #000000;">state_in_sysfs</span>:1;
    <span style="color: #0000ff;">unsigned</span> <span style="color: #0000ff;">int</span> <span style="color: #000000;">state_add_uevent_sent</span>:1;
    <span style="color: #0000ff;">unsigned</span> <span style="color: #0000ff;">int</span> <span style="color: #000000;">state_remove_uevent_sent</span>:1;
    <span style="color: #0000ff;">unsigned</span> <span style="color: #0000ff;">int</span> <span style="color: #000000;">uevent_suppress</span>:1;     <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#31105;&#27490;&#21457;&#36865;uevent</span>
};
</pre>
</div>
<p>
kset和ktype容易混淆，ktype的概念类似于类型，因为包含析构函数，
而kset的概念类似于集合，将多个kobject放在一起。
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> kref</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kref</span> {
    <span style="color: #0000ff;">atomic_t</span> <span style="color: #000000;">refcount</span>;
};
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">kref_init</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kref</span> *<span style="color: #000000;">kref</span>);      <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#21021;&#22987;&#21270;&#20026;1</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">kref_get</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kref</span> *<span style="color: #000000;">kref</span>);       <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#22686;&#21152;&#35745;&#25968;</span>
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">kref_put</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kref</span> *<span style="color: #000000;">kref</span>,         <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#20943;&#23569;&#35745;&#25968;</span>
             <span style="color: #0000ff;">void</span> (*<span style="color: #000000;">release</span>)(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kref</span> *<span style="color: #000000;">kref</span>));
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">__must_check</span> kref_get_unless_zero(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kref</span> *<span style="color: #000000;">kref</span>);
</pre>
</div>
<p>
当kref的计数减少到0的时候，就会有别的线程去释放对象，
此时如果去执行kref_get()就会出现竞态问题，
比较安全的做法是使用kref_get_unless_zero()。
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> kobj_type</h3>
<div class="outline-text-3" id="text-1-2">
<p>
kobj_type相当于kobject的类型，包括了对sysfs操作的方法，
以及对kobject释放的析构函数。
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobj_type</span> {
    <span style="color: #0000ff;">void</span> (*<span style="color: #8b008b; font-weight: bold;">release</span>)(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>);
    <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">sysfs_ops</span> *<span style="color: #000000;">sysfs_ops</span>;
    <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">attribute</span> **<span style="color: #000000;">default_attrs</span>;
    <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobj_ns_type_operations</span> *
    (*<span style="color: #8b008b; font-weight: bold;">child_ns_type</span>)(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>);
    <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">void</span> *(*<span style="color: #0000ff; font-weight: bold;">namespace</span>)(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>);
};
<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">sysfs_ops</span> {
    <span style="color: #0000ff;">ssize_t</span> (*<span style="color: #8b008b; font-weight: bold;">show</span>)(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>, <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">attribute</span> *<span style="color: #000000;">attr</span>,
                    <span style="color: #0000ff;">char</span> *<span style="color: #000000;">buf</span>);
    <span style="color: #0000ff;">ssize_t</span> (*<span style="color: #8b008b; font-weight: bold;">store</span>)(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>, <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">attribute</span> *<span style="color: #000000;">attr</span>,
                     <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">buf</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">len</span>);
};
</pre>
</div>
</div>
</div>
