kernel/2014-10-02-linux-kernel-object.org
** kset
kset是一个kobject的集合，通过链表将集合内部的kobject串接起来。
并且kset本身也被设计为一个kobject对象，
因此也可以进一步将多个kset放到一个更大的kset中去。
#+BEGIN_SRC cpp
  struct kset {
      struct list_head list;              // node: kobj->list
      spinlock_t list_lock;
      struct kobject kobj;
      const struct kset_uevent_ops *uevent_ops;
  };

  struct kset_uevent_ops {
      int (* const filter)(struct kset *kset, struct kobject *kobj);
      const char *(* const name)(struct kset *kset,
                                 struct kobject *kobj);
      int (* const uevent)(struct kset *kset, struct kobject *kobj,
                           struct kobj_uevent_env *env);
  };
#+END_SRC
kset_uevent_ops简单说明：
- filter() 过滤不需要发送的uevent事件
- name() 用于获取subsystem的名字
- uevent() 一般负责添加更多的环境变量和执行dev->bus->uevent()

#+BEGIN_SRC cpp
  struct kobj_uevent_env {
      char *argv[3];
      char *envp[UEVENT_NUM_ENVP];
      int envp_idx;
      char buf[UEVENT_BUFFER_SIZE];
      int buflen;
  };
#+END_SRC
kobject_uevent_env用于保存环境变量。

kset相关操作如下
#+BEGIN_SRC cpp
  void kset_init(struct kset *kset);
  int __must_check kset_register(struct kset *kset);
  extern void kset_unregister(struct kset *kset);
  struct kset * __must_check
  kset_create_and_add(const char *name,
                      const struct kset_uevent_ops *uops,
                      struct kobject *parent);
  struct kset *to_kset(struct kobject *kobj);
  struct kset *kset_get(struct kset *kset);  // 调用kobject_get()
  void kset_put(struct kset *kset);          // 调用kobject_put()
  struct kobj_type *get_ktype(struct kobject *kobj);
  struct kobject *kset_find_obj(struct kset *kset, const char *name);

#+END_SRC
