kernel/2014-10-02-linux-kernel-object.html
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> kset</h3>
<div class="outline-text-3" id="text-1-3">
<p>
kset是一个kobject的集合，通过链表将集合内部的kobject串接起来。
并且kset本身也被设计为一个kobject对象，
因此也可以进一步将多个kset放到一个更大的kset中去。
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kset</span> {
    <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">list_head</span> <span style="color: #000000;">list</span>;              <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">node: kobj-&gt;list</span>
    <span style="color: #0000ff;">spinlock_t</span> <span style="color: #000000;">list_lock</span>;
    <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> <span style="color: #000000;">kobj</span>;
    <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kset_uevent_ops</span> *<span style="color: #000000;">uevent_ops</span>;
};

<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kset_uevent_ops</span> {
    <span style="color: #0000ff;">int</span> (* <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #8b008b; font-weight: bold;">filter</span>)(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kset</span> *<span style="color: #000000;">kset</span>, <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>);
    <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *(* <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #8b008b; font-weight: bold;">name</span>)(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kset</span> *<span style="color: #000000;">kset</span>,
                               <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>);
    <span style="color: #0000ff;">int</span> (* <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #8b008b; font-weight: bold;">uevent</span>)(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kset</span> *<span style="color: #000000;">kset</span>, <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>,
                         <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobj_uevent_env</span> *<span style="color: #000000;">env</span>);
};
</pre>
</div>
<p>
kset_uevent_ops简单说明：
</p>
<ul class="org-ul">
<li>filter() 过滤不需要发送的uevent事件
</li>
<li>name() 用于获取subsystem的名字
</li>
<li>uevent() 一般负责添加更多的环境变量和执行dev-&gt;bus-&gt;uevent()
</li>
</ul>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobj_uevent_env</span> {
    <span style="color: #0000ff;">char</span> *<span style="color: #000000;">argv</span>[3];
    <span style="color: #0000ff;">char</span> *<span style="color: #000000;">envp</span>[UEVENT_NUM_ENVP];
    <span style="color: #0000ff;">int</span> <span style="color: #000000;">envp_idx</span>;
    <span style="color: #0000ff;">char</span> <span style="color: #000000;">buf</span>[UEVENT_BUFFER_SIZE];
    <span style="color: #0000ff;">int</span> <span style="color: #000000;">buflen</span>;
};
</pre>
</div>
<p>
kobject_uevent_env用于保存环境变量。
</p>

<p>
kset相关操作如下
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">kset_init</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kset</span> *<span style="color: #000000;">kset</span>);
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">__must_check</span> kset_register(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kset</span> *<span style="color: #000000;">kset</span>);
<span style="color: #0000ff; font-weight: bold;">extern</span> <span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">kset_unregister</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kset</span> *<span style="color: #000000;">kset</span>);
<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kset</span> * <span style="color: #8b008b; font-weight: bold;">__must_check</span>
kset_create_and_add(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">name</span>,
                    <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kset_uevent_ops</span> *<span style="color: #000000;">uops</span>,
                    <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">parent</span>);
<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kset</span> *<span style="color: #8b008b; font-weight: bold;">to_kset</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>);
<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kset</span> *<span style="color: #8b008b; font-weight: bold;">kset_get</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kset</span> *<span style="color: #000000;">kset</span>);  <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#35843;&#29992;kobject_get()</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">kset_put</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kset</span> *<span style="color: #000000;">kset</span>);          <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#35843;&#29992;kobject_put()</span>
<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobj_type</span> *<span style="color: #8b008b; font-weight: bold;">get_ktype</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>);
<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #8b008b; font-weight: bold;">kset_find_obj</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kset</span> *<span style="color: #000000;">kset</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">name</span>);
</pre>
</div>
</div>
</div>
