kernel/2014-10-02-linux-kernel-object.org
** kobject操作
#+BEGIN_SRC cpp
  // 该函数会分配保存名字所需的空间
  int kobject_set_name(struct kobject *kobj, const char *name, ...);
  const char *kobject_name(const struct kobject *kobj);
  void kobject_init(struct kobject *kobj, struct kobj_type *ktype);
  // 会调用kobject_set_name()设置名字
  int kobject_add(struct kobject *kobj, struct kobject *parent,
                  const char *fmt, ...);
  int kobject_init_and_add(struct kobject *kobj,
                           struct kobj_type *ktype,
                           struct kobject *parent,
                           const char *fmt, ...);
  void kobject_del(struct kobject *kobj);
  struct kobject * __must_check kobject_create(void);
  struct kobject * __must_check
  kobject_create_and_add(const char *name, struct kobject *parent);
  int __must_check kobject_rename(struct kobject *kobj,
                                  const char *name);
  int __must_check kobject_move(struct kobject *kobj,
                                struct kobject *new_parent);
  struct kobject *kobject_get(struct kobject *kobj);
  void kobject_put(struct kobject *kobj);
#+END_SRC

kobject和uevent是紧密相连的，下面几个是和uevent相关的函数。
#+BEGIN_SRC cpp
  int kobject_uevent(struct kobject *kobj, enum kobject_action action);
  int kobject_uevent_env(struct kobject *kobj,
                         enum kobject_action action,
                         char *envp[]);
  // 将环境变量加入到env中
  int add_uevent_var(struct kobj_uevent_env *env,
                     const char *format, ...);
  // 将字符串转换为enum
  int kobject_action_type(const char *buf, size_t len,
                          enum kobject_action *type);
#+END_SRC

* uevent
提到kobject就不得不提到uevent，uevent是User space EVENT的缩写。
当用户插拔设备的时候，内核检测到设备插拔并发出插拔事件，
调用/proc/sys/kernel/hotplug中指定的用户空间应用对事件进行处理。

kobject代表一个sysfs目录，kobj_type代表类型，
提供对象的析构函数和对sysfs操作的接口。
kset代表子系统，包括了对子系统的操作集，如过滤，获取参数，填充环境变量等，
同一个kset内部的kobject共享一组uevent_ops。

以device_add为例，该函数的主要工作如下：
- 如果没有名字，设置设备的名字
- 设置其kobj的parent，kobj_add()添加kobject到parent下
- 创建设备sysfs目录下的文件
  - uevent
  - dev：有设备号才会创建
- device_add_class_symlinks()
  - subsystem：位于设备属性下，指向所属的子系统的符号链接。
  - device：位于设备属性下，有父亲且不是分区时才会创建，
    指向父设备的符号链接。
  - name：位于子系统属性下，指向设备属性，
    名字和设备名相同，如果是块设备就不会创建，
    因为已经在/sys/block下面创建了和设备名相同的符号链接。
- device_add_attrs()
  - dev->class->dev_groups
  - dev->type->groups
  - dev->groups
  - dev_attr_online
- bus_add_device()
  - device_add_attrs() 添加总线属性，不同于设备属性
  - bus->dev_groups
  - name：位于总线属性下，指向设备的符号链接
  - subsystem：位于设备属性下，指向总线的符号链接
- dpm_sysfs_add()
  - 动态PM相关sysfs文件
- device_pm_add()
  将设备添加到PM核心链表
- blocking_notifier_call_chain()
- =kobject_uevent(&dev->kobj, KOBJ_ADD);=
- bus_probe_device()
  为设备探测合适的驱动

该函数会通过kobject_uevent()发出uevent事件，甚至此时内核中可能没有对应的驱动，
但是用户空间的uevent_helper可以利用uevent信息来载入驱动，
载入驱动的时候也会执行一次设备和驱动间的匹配，从而实现动态载入驱动。

