kernel/2014-10-02-linux-kernel-object.html
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> kobject操作</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#35813;&#20989;&#25968;&#20250;&#20998;&#37197;&#20445;&#23384;&#21517;&#23383;&#25152;&#38656;&#30340;&#31354;&#38388;</span>
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">kobject_set_name</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">name</span>, ...);
<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #8b008b; font-weight: bold;">kobject_name</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>);
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">kobject_init</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>, <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobj_type</span> *<span style="color: #000000;">ktype</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#20250;&#35843;&#29992;kobject_set_name()&#35774;&#32622;&#21517;&#23383;</span>
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">kobject_add</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>, <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">parent</span>,
                <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">fmt</span>, ...);
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">kobject_init_and_add</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>,
                         <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobj_type</span> *<span style="color: #000000;">ktype</span>,
                         <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">parent</span>,
                         <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">fmt</span>, ...);
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">kobject_del</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>);
<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> * <span style="color: #8b008b; font-weight: bold;">__must_check</span> kobject_create(<span style="color: #0000ff;">void</span>);
<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> * <span style="color: #8b008b; font-weight: bold;">__must_check</span>
kobject_create_and_add(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">name</span>, <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">parent</span>);
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">__must_check</span> kobject_rename(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>,
                                <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">name</span>);
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">__must_check</span> kobject_move(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>,
                              <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">new_parent</span>);
<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #8b008b; font-weight: bold;">kobject_get</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>);
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">kobject_put</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>);
</pre>
</div>

<p>
kobject和uevent是紧密相连的，下面几个是和uevent相关的函数。
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">kobject_uevent</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>, <span style="color: #0000ff; font-weight: bold;">enum</span> <span style="color: #0000ff;">kobject_action</span> <span style="color: #000000;">action</span>);
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">kobject_uevent_env</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>,
                       <span style="color: #0000ff; font-weight: bold;">enum</span> <span style="color: #0000ff;">kobject_action</span> <span style="color: #000000;">action</span>,
                       <span style="color: #0000ff;">char</span> *<span style="color: #000000;">envp</span>[]);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#23558;&#29615;&#22659;&#21464;&#37327;&#21152;&#20837;&#21040;env&#20013;</span>
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">add_uevent_var</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobj_uevent_env</span> *<span style="color: #000000;">env</span>,
                   <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">format</span>, ...);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#23558;&#23383;&#31526;&#20018;&#36716;&#25442;&#20026;enum</span>
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">kobject_action_type</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">buf</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">len</span>,
                        <span style="color: #0000ff; font-weight: bold;">enum</span> <span style="color: #0000ff;">kobject_action</span> *<span style="color: #000000;">type</span>);
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> uevent</h2>
<div class="outline-text-2" id="text-2">
<p>
提到kobject就不得不提到uevent，uevent是User space EVENT的缩写。
当用户插拔设备的时候，内核检测到设备插拔并发出插拔事件，
调用/proc/sys/kernel/hotplug中指定的用户空间应用对事件进行处理。
</p>

<p>
kobject代表一个sysfs目录，kobj_type代表类型，
提供对象的析构函数和对sysfs操作的接口。
kset代表子系统，包括了对子系统的操作集，如过滤，获取参数，填充环境变量等，
同一个kset内部的kobject共享一组uevent_ops。
</p>

<p>
以device_add为例，该函数的主要工作如下：
</p>
<ul class="org-ul">
<li>如果没有名字，设置设备的名字
</li>
<li>设置其kobj的parent，kobj_add()添加kobject到parent下
</li>
<li>创建设备sysfs目录下的文件
<ul class="org-ul">
<li>uevent
</li>
<li>dev：有设备号才会创建
</li>
</ul>
</li>
<li>device_add_class_symlinks()
<ul class="org-ul">
<li>subsystem：位于设备属性下，指向所属的子系统的符号链接。
</li>
<li>device：位于设备属性下，有父亲且不是分区时才会创建，
指向父设备的符号链接。
</li>
<li>name：位于子系统属性下，指向设备属性，
名字和设备名相同，如果是块设备就不会创建，
因为已经在/sys/block下面创建了和设备名相同的符号链接。
</li>
</ul>
</li>
<li>device_add_attrs()
<ul class="org-ul">
<li>dev-&gt;class-&gt;dev_groups
</li>
<li>dev-&gt;type-&gt;groups
</li>
<li>dev-&gt;groups
</li>
<li>dev_attr_online
</li>
</ul>
</li>
<li>bus_add_device()
<ul class="org-ul">
<li>device_add_attrs() 添加总线属性，不同于设备属性
</li>
<li>bus-&gt;dev_groups
</li>
<li>name：位于总线属性下，指向设备的符号链接
</li>
<li>subsystem：位于设备属性下，指向总线的符号链接
</li>
</ul>
</li>
<li>dpm_sysfs_add()
<ul class="org-ul">
<li>动态PM相关sysfs文件
</li>
</ul>
</li>
<li>device_pm_add()
将设备添加到PM核心链表
</li>
<li>blocking_notifier_call_chain()
</li>
<li><code>kobject_uevent(&amp;dev-&gt;kobj, KOBJ_ADD);</code>
</li>
<li>bus_probe_device()
为设备探测合适的驱动
</li>
</ul>

<p>
该函数会通过kobject_uevent()发出uevent事件，甚至此时内核中可能没有对应的驱动，
但是用户空间的uevent_helper可以利用uevent信息来载入驱动，
载入驱动的时候也会执行一次设备和驱动间的匹配，从而实现动态载入驱动。
</p>
</div>
