kernel/2014-10-02-linux-kernel-object.org
** kobject_uevent()
这个函数有必要梳理一下
#+BEGIN_SRC cpp
  int kobject_uevent(struct kobject *kobj, enum kobject_action action)
  {
      return kobject_uevent_env(kobj, action, NULL);
  }
#+END_SRC
这里假定所有函数都能成功执行，将其简化后如下所示。
#+BEGIN_SRC cpp
  int kobject_uevent_env(struct kobject *kobj,
                         enum kobject_action action,
                         char *envp_ext[])
  {
      struct kobj_uevent_env *env =
          kzalloc(sizeof(struct kobj_uevent_env), GFP_KERNEL);
      // 利用字符串数组将enum转换为字符串
      const char *action_string = kobject_actions[action];
      struct kobject *top_kobj = ...;             // 必须找到kset
      struct kset *kset = top_kobj->kset;
      const struct kset_uevent_ops *uevent_ops = kset->uevent_ops;
      const char *subsystem;

      if (kobj->uevent_suppress)                  // 禁止发出
          return 0;
      if (uevent_ops && uevent_ops->filter)
          if (!uevent_ops->filter(kset, kobj))    // 被过滤
              return 0;

      if (uevent_ops && uevent_ops->name)
          subsystem = uevent_ops->name(kset, kobj);
      else
          subsystem = kobject_name(&kset->kobj);
      if (!subsystem)                             // 必须有子系统
          return 0;

      const char *devpath = kobject_get_path(kobj, GFP_KERNEL);
      add_uevent_var(env, "ACTION=%s", action_string);
      add_uevent_var(env, "DEVPATH=%s", devpath);
      add_uevent_var(env, "SUBSYSTEM=%s", subsystem);
      for (int i = 0; envp_ext && envp_ext[i]; i++) // 额外环境变量
              add_uevent_var(env, "%s", envp_ext[i]);
      if (uevent_ops && uevent_ops->uevent)       // kset操作
          uevent_ops->uevent(kset, kobj, env);

      if (action == KOBJ_ADD)
          kobj->state_add_uevent_sent = 1;
      else if (action == KOBJ_REMOVE)
          kobj->state_remove_uevent_sent = 1;

      mutex_lock(&uevent_sock_mutex);
      add_uevent_var(env, "SEQNUM=%llu",          // 序列号
                     (unsigned long long)++uevent_seqnum);

  #ifdef CONFIG_NET
      struct uevent_sock *ue_sk;
      list_for_each_entry(ue_sk, &uevent_sock_list, list) {
          struct sock *uevent_sock = ue_sk->sk;
          struct sk_buff *skb;
          char *scratch;
          size_t len;

          if (!netlink_has_listeners(uevent_sock, 1))
              continue;

          len = strlen(action_string) + strlen(devpath) + 2;
          skb = alloc_skb(len + env->buflen, GFP_KERNEL);

          scratch = skb_put(skb, len);
          sprintf(scratch, "%s@%s", action_string, devpath);

          for (i = 0; i < env->envp_idx; i++) {
              len = strlen(env->envp[i]) + 1;
              scratch = skb_put(skb, len);
              strcpy(scratch, env->envp[i]);
          }

          NETLINK_CB(skb).dst_group = 1;
          netlink_broadcast_filtered(uevent_sock, skb, 0, 1, GFP_KERNEL,
                                     kobj_bcast_filter, kobj);
      }
  #endif
      mutex_unlock(&uevent_sock_mutex);

  #ifdef CONFIG_UEVENT_HELPER
      if (uevent_helper[0] && !kobj_usermode_filter(kobj)) {
          struct subprocess_info *info;
          const char *path = "PATH=/sbin:/bin:/usr/sbin:/usr/bin"
          add_uevent_var(env, "HOME=/");
          add_uevent_var(env, path);
          init_uevent_argv(env, subsystem);
          info = call_usermodehelper_setup(env->argv[0], env->argv,
                                           env->envp, GFP_KERNEL, NULL,
                                           cleanup_uevent_env, env);
          call_usermodehelper_exec(info, UMH_NO_WAIT);
          env = NULL;     /* freed by cleanup_uevent_env */
      }
  #endif

   exit:
      kfree(devpath);
      kfree(env);
      return 0;
  }
#+END_SRC
从中可以看出，要使用netlink发出uevent，必须配置NET，
同样，要使用uevent_helper发出uevent，必须配置UEVENT_HELPER。
udev通过netlink监听，mdev则通过uevent_helper监听。
