kernel/2014-10-02-linux-kernel-object.html

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> kobject_uevent()</h3>
<div class="outline-text-3" id="text-2-1">
<p>
这个函数有必要梳理一下
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">kobject_uevent</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>, <span style="color: #0000ff; font-weight: bold;">enum</span> <span style="color: #0000ff;">kobject_action</span> <span style="color: #000000;">action</span>)
{
    <span style="color: #0000ff; font-weight: bold;">return</span> kobject_uevent_env(kobj, action, <span style="color: #5f9ea0;">NULL</span>);
}
</pre>
</div>
<p>
这里假定所有函数都能成功执行，将其简化后如下所示。
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">kobject_uevent_env</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">kobj</span>,
                       <span style="color: #0000ff; font-weight: bold;">enum</span> <span style="color: #0000ff;">kobject_action</span> <span style="color: #000000;">action</span>,
                       <span style="color: #0000ff;">char</span> *<span style="color: #000000;">envp_ext</span>[])
{
    <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobj_uevent_env</span> *<span style="color: #000000;">env</span> =
        kzalloc(<span style="color: #0000ff; font-weight: bold;">sizeof</span>(<span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobj_uevent_env</span>), GFP_KERNEL);
    <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#21033;&#29992;&#23383;&#31526;&#20018;&#25968;&#32452;&#23558;enum&#36716;&#25442;&#20026;&#23383;&#31526;&#20018;</span>
    <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">action_string</span> = kobject_actions[action];
    <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kobject</span> *<span style="color: #000000;">top_kobj</span> = ...;             <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#24517;&#39035;&#25214;&#21040;kset</span>
    <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kset</span> *<span style="color: #000000;">kset</span> = top_kobj-&gt;kset;
    <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">kset_uevent_ops</span> *<span style="color: #000000;">uevent_ops</span> = kset-&gt;uevent_ops;
    <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">subsystem</span>;

    <span style="color: #0000ff; font-weight: bold;">if</span> (kobj-&gt;uevent_suppress)                  <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#31105;&#27490;&#21457;&#20986;</span>
        <span style="color: #0000ff; font-weight: bold;">return</span> 0;
    <span style="color: #0000ff; font-weight: bold;">if</span> (uevent_ops &amp;&amp; uevent_ops-&gt;filter)
        <span style="color: #0000ff; font-weight: bold;">if</span> (!uevent_ops-&gt;filter(kset, kobj))    <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#34987;&#36807;&#28388;</span>
            <span style="color: #0000ff; font-weight: bold;">return</span> 0;

    <span style="color: #0000ff; font-weight: bold;">if</span> (uevent_ops &amp;&amp; uevent_ops-&gt;name)
        subsystem = uevent_ops-&gt;name(kset, kobj);
    <span style="color: #0000ff; font-weight: bold;">else</span>
        subsystem = kobject_name(&amp;kset-&gt;kobj);
    <span style="color: #0000ff; font-weight: bold;">if</span> (!subsystem)                             <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#24517;&#39035;&#26377;&#23376;&#31995;&#32479;</span>
        <span style="color: #0000ff; font-weight: bold;">return</span> 0;

    <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">devpath</span> = kobject_get_path(kobj, GFP_KERNEL);
    add_uevent_var(env, <span style="color: #ff0000;">"ACTION=%s"</span>, action_string);
    add_uevent_var(env, <span style="color: #ff0000;">"DEVPATH=%s"</span>, devpath);
    add_uevent_var(env, <span style="color: #ff0000;">"SUBSYSTEM=%s"</span>, subsystem);
    <span style="color: #0000ff; font-weight: bold;">for</span> (<span style="color: #0000ff;">int</span> <span style="color: #000000;">i</span> = 0; envp_ext &amp;&amp; envp_ext[i]; i++) <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#39069;&#22806;&#29615;&#22659;&#21464;&#37327;</span>
            add_uevent_var(env, <span style="color: #ff0000;">"%s"</span>, envp_ext[i]);
    <span style="color: #0000ff; font-weight: bold;">if</span> (uevent_ops &amp;&amp; uevent_ops-&gt;uevent)       <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">kset&#25805;&#20316;</span>
        uevent_ops-&gt;uevent(kset, kobj, env);

    <span style="color: #0000ff; font-weight: bold;">if</span> (action == KOBJ_ADD)
        kobj-&gt;state_add_uevent_sent = 1;
    <span style="color: #0000ff; font-weight: bold;">else</span> <span style="color: #0000ff; font-weight: bold;">if</span> (action == KOBJ_REMOVE)
        kobj-&gt;state_remove_uevent_sent = 1;

    mutex_lock(&amp;uevent_sock_mutex);
    add_uevent_var(env, <span style="color: #ff0000;">"SEQNUM=%llu"</span>,          <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#24207;&#21015;&#21495;</span>
                   (<span style="color: #0000ff;">unsigned</span> <span style="color: #0000ff;">long</span> <span style="color: #0000ff;">long</span>)++uevent_seqnum);

<span style="color: #000000;">#ifdef</span> CONFIG_NET
    <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">uevent_sock</span> *<span style="color: #000000;">ue_sk</span>;
    <span style="color: #000000;">list_for_each_entry</span>(ue_sk, &amp;uevent_sock_list, <span style="color: #0000ff;">list</span>) {
        <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">sock</span> *<span style="color: #000000;">uevent_sock</span> = ue_sk-&gt;sk;
        <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">sk_buff</span> *<span style="color: #000000;">skb</span>;
        <span style="color: #0000ff;">char</span> *<span style="color: #000000;">scratch</span>;
        <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">len</span>;

        <span style="color: #0000ff; font-weight: bold;">if</span> (!netlink_has_listeners(uevent_sock, 1))
            <span style="color: #0000ff; font-weight: bold;">continue</span>;

        len = strlen(action_string) + strlen(devpath) + 2;
        skb = alloc_skb(len + env-&gt;buflen, GFP_KERNEL);

        scratch = skb_put(skb, len);
        sprintf(scratch, <span style="color: #ff0000;">"%s@%s"</span>, action_string, devpath);

        <span style="color: #0000ff; font-weight: bold;">for</span> (i = 0; i &lt; env-&gt;envp_idx; i++) {
            len = strlen(env-&gt;envp[i]) + 1;
            scratch = skb_put(skb, len);
            strcpy(scratch, env-&gt;envp[i]);
        }

        NETLINK_CB(skb).dst_group = 1;
        netlink_broadcast_filtered(uevent_sock, skb, 0, 1, GFP_KERNEL,
                                   kobj_bcast_filter, kobj);
    }
<span style="color: #000000;">#endif</span>
    mutex_unlock(&amp;uevent_sock_mutex);

<span style="color: #000000;">#ifdef</span> CONFIG_UEVENT_HELPER
    <span style="color: #0000ff; font-weight: bold;">if</span> (uevent_helper[0] &amp;&amp; !kobj_usermode_filter(kobj)) {
        <span style="color: #0000ff; font-weight: bold;">struct</span> <span style="color: #0000ff;">subprocess_info</span> *<span style="color: #000000;">info</span>;
        <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">path</span> = <span style="color: #ff0000;">"PATH=/sbin:/bin:/usr/sbin:/usr/bin"</span>
        add_uevent_var(env, <span style="color: #ff0000;">"HOME=/"</span>);
        add_uevent_var(env, path);
        init_uevent_argv(env, subsystem);
        info = call_usermodehelper_setup(env-&gt;argv[0], env-&gt;argv,
                                         env-&gt;envp, GFP_KERNEL, <span style="color: #5f9ea0;">NULL</span>,
                                         cleanup_uevent_env, env);
        call_usermodehelper_exec(info, UMH_NO_WAIT);
        env = <span style="color: #5f9ea0;">NULL</span>;     <span style="color: #228b22; font-style: italic;">/* </span><span style="color: #228b22; font-style: italic;">freed by cleanup_uevent_env */</span>
    }
<span style="color: #000000;">#endif</span>

 <span style="color: #5f9ea0;">exit</span>:
    kfree(devpath);
    kfree(env);
    <span style="color: #0000ff; font-weight: bold;">return</span> 0;
}
</pre>
</div>
<p>
从中可以看出，要使用netlink发出uevent，必须配置NET，
同样，要使用uevent_helper发出uevent，必须配置UEVENT_HELPER。
udev通过netlink监听，mdev则通过uevent_helper监听。
</p>
</div>
</div>
</div>
</div>
</body>
</html>
